tap "candid82/brew"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
tap "shopify/shopify"
tap "yqrashawn/goku"
brew "tree"
brew "ansible"
brew "jpeg-xl"
brew "aom"
brew "python@3.12"
brew "awscli"
brew "cairo"
brew "harfbuzz"
brew "python@3.13"
brew "openjdk"
brew "bfg"
brew "boost"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cloudflared"
brew "cocoapods"
brew "curl"
brew "libavif"
brew "libpq"
brew "php"
brew "composer"
brew "docker"
brew "docker-compose"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "openjpeg"
brew "leptonica"
brew "librist"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "git-gui"
brew "libusb"
brew "guile"
brew "hdf5"
brew "ios-deploy"
brew "node"
brew "jupyterlab"
brew "kubernetes-cli"
brew "minikube"
brew "mysql"
brew "nghttp2"
brew "nginx", restart_service: :changed
brew "nvm"
brew "openssl@1.1"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "postgresql@17"
brew "powerlevel10k"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "redis", restart_service: :changed
brew "scrcpy"
brew "switchaudio-osx"
brew "tcl-tk"
brew "tectonic"
brew "telnet"
brew "watch"
brew "watchexec"
brew "watchman"
brew "wget"
brew "yarn"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "shopify/shopify/shopify-cli"
brew "yqrashawn/goku/goku"
cask "anaconda"
cask "android-platform-tools"
cask "basictex"
cask "brave-browser"
cask "chatall"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "firefox"
cask "flipper"
cask "foxitreader"
cask "iterm2"
cask "kawa-app"
cask "ngrok"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "skype"
cask "sublime-text"
cask "temurin@17"
cask "warp"
cask "zulu@11"
vscode "aaron-bond.better-comments"
vscode "alexcvzz.vscode-sqlite"
vscode "alexkev.clg"
vscode "amimaro.remix-run-snippets"
vscode "anbuselvanrocky.bootstrap5-vscode"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "atlassian.atlascode"
vscode "berublan.vscode-log-viewer"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.markdown-mermaid"
vscode "chiangs.remix-ts-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "dkundel.vscode-new-file"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "drewbarrett.vscode-coffeescript-preview"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "humao.rest-client"
vscode "infinity1207.angular2-switcher"
vscode "ionutvmi.path-autocomplete"
vscode "james-yu.latex-workshop"
vscode "johnpapa.angular2"
vscode "koppt.vscode-view-in-browser"
vscode "leizongmin.node-module-intellisense"
vscode "lokalise.i18n-ally"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "shopify.polaris-for-vscode"
vscode "shopify.theme-check-vscode"
vscode "sleistner.vscode-fileutils"
vscode "standard.vscode-standard"
vscode "tabnine.tabnine-vscode"
vscode "thekalinga.bootstrap4-vscode"
vscode "tlevesque.import-to-require"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "winnnntttter.find-unused"
vscode "xabikos.javascriptsnippets"
vscode "yy0931.save-as-root"
vscode "yy0931.vscode-sqlite3-editor"
vscode "zaczero.bootstrap-v4-snippets"
vscode "zainchen.json"
npm "@angular/cli"
npm "corepack"
npm "n8n"
npm "typescript"
