tap "candid82/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
tap "yqrashawn/goku"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# Tool Command Language
brew "tcl-tk"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Library for USB device access
brew "libusb"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node", link: false
# Platform built on V8 to build network applications
brew "node@12"
# Manage multiple Node.js versions
brew "nvm"
# Display and control your Android device
brew "scrcpy"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# karabiner configurator
brew "yqrashawn/goku/goku"
# Desktop debugging platform for mobile developers
cask "flipper"
